{
  "backend/main.mo": "Actor storing contact form submissions in a list with functions to submit a form and retrieve recent entries.",
  "feature_evidence.json": "Report file mapping implemented features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend source files for reference.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, CSS variables, and light/dark mode theme values.",
  "frontend/index.html": "Base HTML file loading the root container and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all site pages using SiteLayout as the root component.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with branding, navigation links, contact info, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop navigation, and mobile menu using Sheet components.",
  "frontend/src/components/SiteLayout.tsx": "Layout component rendering header, page content via Outlet, and footer.",
  "frontend/src/content/newsEventsSeed.ts": "Static seed dataset defining news and event items with metadata and full content.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines an Internet Identity context and provider that manages authentication state, login flow, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and defines custom light and dark theme CSS variables for colors and UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with school history, mission, values, and styled informational sections.",
  "frontend/src/pages/AcademicsPage.tsx": "Displays academic programs, grade levels, subjects, and extracurricular offerings in a styled layout.",
  "frontend/src/pages/AdmissionsPage.tsx": "Shows admissions steps, requirements, and FAQs with cards, accordions, and structured content.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and backend submission plus a sidebar showing school contact info.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, highlights grid, and a preview of recent news/events.",
  "frontend/src/pages/NewsEventsPage.tsx": "Displays filterable news and events using expandable cards sourced from static seed data.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines the project’s metadata, features, requirements, and image needs for the St Martin School website."
}